README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-19 Mon 00:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>EOF Plot</title>
<meta name="author" content="Daniel Simpson" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">EOF Plot</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb48df4a">1. Overview</a>
<ul>
<li><a href="#org08837fc">1.1. Features</a>
<ul>
<li><a href="#orgd0f7277">1.1.1. Requirements</a></li>
<li><a href="#orgf11d826">1.1.2. Usage</a></li>
<li><a href="#orga27c05f">1.1.3. License</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgb48df4a" class="outline-2">
<h2 id="orgb48df4a"><span class="section-number-2">1.</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
This project is a Streamlit application that provides information about the end-of-life (EOL) status of various technologies. It fetches data from the EndOfLife API and visualizes it using interactive charts.
</p>
</div>
<div id="outline-container-org08837fc" class="outline-3">
<h3 id="org08837fc"><span class="section-number-3">1.1.</span> Features</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Select a technology from a dropdown menu.</li>
<li>View detailed information about specific versions.</li>
<li>Visualize EOL status with color-coded bar charts.</li>
</ul>
</div>
<div id="outline-container-orgd0f7277" class="outline-4">
<h4 id="orgd0f7277"><span class="section-number-4">1.1.1.</span> Requirements</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>Python 3.x</li>
<li>Streamlit</li>
<li>Requests</li>
<li>Pandas</li>
<li>Plotly</li>
</ul>
</div>
</div>
<div id="outline-container-orgf11d826" class="outline-4">
<h4 id="orgf11d826"><span class="section-number-4">1.1.2.</span> Usage</h4>
<div class="outline-text-4" id="text-1-1-2">
<ol class="org-ol">
<li>Run the application:
```bash
streamlit run eof.py
```</li>
<li>Open the provided URL in your browser.</li>
<li>Select a technology and explore its EOL information.</li>
</ol>
</div>
</div>
<div id="outline-container-orga27c05f" class="outline-4">
<h4 id="orga27c05f"><span class="section-number-4">1.1.3.</span> License</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
This project is licensed under the MIT License.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-05-18 Sun 00:00</p>
<p class="author">Author: Daniel Simpson</p>
<p class="date">Created: 2025-05-19 Mon 00:32</p>
</div>
</body>
</html>
